In [20]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass  # To get the password without showing the input

In [21]:
password = getpass.getpass()

········

In [22]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)
data = pd.read_sql_query('SELECT * FROM actor', engine)
data.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [23]:
data.shape

(200, 4)

In [24]:
data.dtypes

actor_id                int64
first_name             object
last_name              object
last_update    datetime64[ns]
dtype: object

In [ ]:
#How many distinct (different) actors' last names are there?

In [25]:
data.nunique()

actor_id       200
first_name     128
last_name      121
last_update      1
dtype: int64

In [ ]:
#Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [26]:
'''SELECT *
         'CASE
          WHEN weekday(rental_date) < 6 then 'workday'
          ELSE 'weekend'
          END AS 'day_type'
         FROM rental;'''

data = pd.read_sql_query('SELECT * FROM rental', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [ ]:
#Get all films with ARMAGEDDON in the title.

In [36]:
film = '''select title
from film
WHERE title LIKE '%%Armageddon%%'
;'''

data = pd.read_sql_query(film, engine)
data.head(10)

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

In [ ]:
#Get 10 the longest films

In [37]:
film = '''select title, length
from film
ORDER BY length DESC
limit 10
;'''

data = pd.read_sql_query(film, engine)
data.head(10)

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

In [ ]:
#How many films include Behind the Scenes content?

In [38]:
num_films = '''SELECT COUNT(film_id) AS "n_movies_behindthescenes" 
from film
WHERE special_features LIKE '%%Behind the Scenes%%'
;'''

data = pd.read_sql_query(num_films, engine)
data.head(10)

   n_movies_behindthescenes
0                       538

In [ ]:
#Which kind of movies (rating) have a mean duration of more than two hours?

In [39]:
rating = '''SELECT rating, length
from film
WHERE length > 120
GROUP BY rating
;'''

data = pd.read_sql_query(rating, engine)
data.head()

  rating  length
0      G     130
1     PG     169
2  NC-17     180
3      R     129
4  PG-13     153

In [ ]:
#Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [40]:
length = '''SELECT title,length,rating, row_number() OVER (
ORDER BY length DESC ) ranking
FROM sakila.film
;'''

data = pd.read_sql_query(length, engine)
data.head()

            title  length rating  ranking
0   CHICAGO NORTH     185  PG-13        1
1  CONTROL ANTHEM     185      G        2
2  DARN FORRESTER     185      G        3
3     GANGS PRIDE     185  PG-13        4
4       HOME PITY     185      R        5